
clc
clear 
%%
A=nan*ones(1,4);
A(1)=504;%最大过水流量
A(2)=3;%装机台数
A(3)=9.51;%最大水头
A(4)=3.35;%最小水头
A(5)=0.5;%水头损失

Tur(1,1)=2.0;%直径
Tur(1,2)=214.3;%额定转速
Tur(1,3)=1100;%最大功率
Tur(1,4)=0.01;%水轮机效率修正
Tur(1,5)=0.95;%发电机效率
Tur(1,6)=1.2500e-06;%管道阻力系数S
Tur(1,7)=250;%最小出力
Tur(1,8)=0.8;%效率

Tur(2,:)=Tur(1,:);



Tur(3,1)=2.0;%直径
Tur(3,2)=214.3;%额定转速
Tur(3,3)=1100;%最大功率
Tur(3,4)=0.01;%水轮机效率修正
Tur(3,5)=0.95;%发电机效率
Tur(3,6)=1.2500e-06;%管道阻力系数S
Tur(3,7)=250;%最小出力
Tur(3,8)=0.8;%效率

% Tur(2,:)=Tur(3,:);

QH=[
    0	177.5
3.80799	177.75
12.08	178
23.72786	178.25
38.3041	178.5
55.53473	178.75
75.22834	179
97.24132	179.25
121.4611	179.5
147.7965	179.75
176.1724	180
232.3124	180.25
268.5882	180.5
306.9627	180.75
347.3888	181
389.825	181.25
434.2351	181.5
480.5864	181.75
587.1751	182
642.7685	182.25
700.4107	182.5
760.0769	182.75
821.7449	183
972.9261	183.25
1044.893	183.5
1118.974	183.75
1195.153	184
1273.413	184.25
1353.737	184.5
1564.533	184.75
	];



U=[1,1,1];
hup=186;
QT=xlsread('水文.xlsx','保证率');
MM=length(QT(:,1));
j=1;
for i=1:MM
    i
    Q=QT(i,1);
    T=QT(i,2);
    if 1%T~=0
        hdown=interp1(QH(:,1),QH(:,2),Q,'linear','extrap');
        [ out(j,:),qout(j,:),hout(j,:),fout(j,:)] = main_opt( Q,hup,hdown,A,Tur,U,QH);
        j=j+1;
    end
end
P=nansum(out,2);
e=P.*QT(:,2);
E=nansum(e(:))
HQUAN=nansum(nansum(out.*hout,2).*QT(:,2))/E
FQUAN=nansum(nansum(out.*fout,2).*QT(:,2))/E
[maxp,ii]=max(P)



